cask_args appdir: '/Applications'

# tap bundle to enable Brewfile syntax
# https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
tap 'homebrew/bundle'

# CLI tools
brew 'ack'
brew 'bash-completion'
brew 'bash-git-prompt'
brew 'git'
brew 'git-flow'
brew 'readline'
brew 'tmux'
brew 'coreutils'
brew 'wget'
brew 'openssl'

# Frameworks
brew 'node'

# Programming Languages
brew 'go'
brew 'scala'

# Others
brew 'pyenv'
brew 'pyenv-virtualenv'

# Casks
cask 'docker'